{
    "last_checked": "2024-04-09T08:56:04.051447",
    "changes": [
        {
            "timestamp": "2024-04-09T08:52:55.795334",
            "content": {
                "What Information We Collect": [
                    "We may collect information from and about you, including information that you provide, information from other sources, and automatically collected information.",
                    "When you create an account, upload content, contact us directly, or otherwise use the Platform, you may provide some or all of the following information:",
                    "We may receive the information described in this Privacy Policy from other sources, such as:",
                    "We automatically collect certain information from you when you use the Platform, including internet or other network activity information such as your IP address, geolocation-related data, unique device identifiers, browsing and search history (including content you have viewed in the Platform), andCookies.",
                    "We may link your contact or account information with your activity on and off our Platform across all your devices, using your email or other log-in or device information. We may use this information to display advertisements on our Platform tailored to your interests, preferences, and characteristics.",
                    "We are not responsible for the privacy practices of our service providers and business partners, and the information practices of these service providers and business partners are not covered by this Privacy Policy.",
                    "We may aggregate or de-identify the information described above. Aggregated or de-identified data is not subject to this Privacy Policy."
                ],
                "How We Use Your Information": [
                    "As explained below, we use your information to improve, support and administer the Platform, to allow you to use its functionalities, and to fulfill and enforce our Terms of Service. We may also use your information to, among other things, show you suggestions, promote the Platform, and customize your ad experience.",
                    "We generally use theInformation We Collect:"
                ],
                "How We Share Your Information": [
                    "We are committed to maintaining your trust, and while TikTok does not sell your personal information or share your personal information with third parties for purposes of cross-context behavioral advertising where restricted by applicable law, we want you to understand when and with whom we may share theInformation We Collectfor business purposes.",
                    "We share the categories of personal information listed above with service providers and business partners to help us perform business operations and for business purposes, including research, payment processing and transaction fulfillment, database maintenance, administering contests and special offers, technology services, deliveries, sending communications, advertising and marketing services, analytics, measurement, data storage and hosting, disaster recovery, search engine optimization, and data processing. These service providers and business partners may include:",
                    "As a global company, the Platform is supported by certain entities within our corporate group, which are given limited remote access toInformation We Collectas necessary to enable them to provide certain important functions. To learn more about how we share information with certain corporate group entities, seehere.",
                    "We may share all of theInformation We Collectin connection with a substantial corporate transaction, such as the sale of a website, a merger, consolidation, asset sales, or in the unlikely event of bankruptcy.",
                    "We may disclose any of theInformation We Collectto respond to subpoenas, court orders, legal process, law enforcement requests, legal claims, or government inquiries, and to protect and defend the rights, interests, safety, and security of the Platform, our affiliates, users, or the public. We may also share any of theInformation We Collectto enforce any terms applicable to the Platform, to exercise or defend any legal claims, and comply with any applicable law.",
                    "We may share your information for other purposes pursuant to your consent or at your direction.",
                    "We partner with third-party services (such as Facebook, Instagram, Twitter, and Google) to offer you a seamless sign-up, log-in, and content-sharing experience. We may share information about you with these third-party services if you choose to use these features. For example, the services may receive information about your activity on the Platform and may notify your connections on the third-party services about your use of the Platform, in accordance with their privacy policies. If you choose to allow a third-party service to access your account, we will share certain information about you with the third party. Depending on the permissions you grant, the third party may be able to obtain your account information and other information you choose to provide.",
                    "If you choose to engage in public activities on the Platform, you should be aware that any information you share may be read, collected, or used by other users. You should use caution in disclosing personal information while using the Platform. We are not responsible for the information you choose to submit.",
                    "When you make a purchase from a third party on the Platform, including from a merchant selling products through our shopping features, we share the information related to the transaction with that third party and their service providers and transaction fulfillment providers. By making the purchase, you are directing us to share your information in this way. These entities may use the information shared in accordance with their privacy policies."
                ],
                "Your Rights": [
                    "You may submit a request to know, access, correct or delete the information we have collectedfrom orabout you athttps://www.tiktok.com/legal/report/privacy. You may appeal any decision we have made about your request by following the instructions in the communication you receive from us notifying you of our decision. You may also exercise your rights to know, access, correct, delete, or appealby sending your request to the physical address provided in the “Contact Us” section below. You can also update your account information directly through your in-app settings, as well as request a copy of your TikTok data or request to deactivate or delete your account. Your right to know includes what personal information we have collected about you, including the categories of sources from which the personal information is collected, the business or commercial purpose for collecting or sharing personal information, the categories of third parties to whom we share the personal information, and the specific pieces of personal information we have collected about you. We do not discriminate based on the exercise of any privacy rights that you might have.",
                    "You may be entitled, in accordance with applicable law, to submit a request through an authorized agent. To designate an authorized agent to exercise choices on your behalf, please provide evidence that you have given such agent power of attorney or that the agent otherwise has valid written authority to submit requests to exercise rights on your behalf. We will respond to your request consistent with applicable law and subject to proper verification. We will verify your request by asking you to send it from the email address associated with your account or to provide information necessary to verify your account.",
                    "More information about requests that we received can be foundhere.",
                    "While some of the information that we collect and use may constitute sensitive personal information, we only process such information in order to provide the Platform and within other exemptions under applicable law. For example, we may process your financial information in order to provide you the goods or services you request from us or your driver’s license number in order to verify your identity."
                ],
                "Your Choices": [],
                "Data Security and Retention": [
                    "We use reasonable measures to help protect information from loss, theft, misuse, unauthorized access, disclosure, alteration, or destruction. You should understand that no data storage system or transmission of data over the Internet or any other public network can be guaranteed to be 100 percent secure. Please note that information collected by third parties may not have the same security protections as information you submit to us, and we are not responsible for protecting the security of such information.",
                    "We retain information for as long as necessary to provide the Platform and for the other purposes set out in this Privacy Policy. We also retain information when necessary to comply with contractual and legal obligations, when we have a legitimate business interest to do so (such as improving and developing the Platform, and enhancing its safety, security and stability), and for the exercise or defense of legal claims.",
                    "The retention periods are different depending on different criteria, such as the type of information and the purposes for which we use the information. For example, when we process your information such as your profile information to provide you with the Platform, we keep this information for as long as you have an account. If you violate our Terms of Service, Community Guidelines, or other conditions or policies, we may remove your profile immediately, but may keep other information about you to process the violation.",
                    "TikTok may transmit your data to its servers or data centers outside of the United States for storage and/or processing. Other entities with whom TikTok may share your data as described herein may be located outside of the United States."
                ],
                "Children and Teens": [
                    "The privacy of Children is important to us. We provide a separate experience for Children in the United States, in which we collect and process only limited information. For information about how we collect, use, share, and otherwise process the personal information of Children, please refer to ourChildren’s Privacy Policy.",
                    "The Platform otherwise is not directed at Children. If we become aware that personal information has been collected on the Platform from a Child, we will delete this information and terminate the Child’s account. If you believe there is a user who is below the age of 13, please contact us at:https://tiktok.com/legal/report/privacy.",
                    "If you are a parent or guardian, ourGuardian's Guidecontains information and resources to help you understand the Platform and the tools and controls you can use."
                ],
                "Other Rights": [
                    "If you are a California resident, once a calendar year, you may be entitled to obtain information about personal information that we shared, if any, with other businesses for their own direct marketing uses. To submit a request, contact us at:https://www.tiktok.com/legal/report/privacy.",
                    "Users of the Platform who are California residents and are under 18 years of age may request and obtain removal of User Content they posted by contacting us at:https://www.tiktok.com/legal/report/privacy. All requests must provide a description of the User Content you want removed and information reasonably sufficient to permit us to locate that User Content. We do not accept California Removal Requests via postal mail, telephone, or facsimile. We may not be able to respond if you do not provide adequate information. Please note that your request does not ensure complete or comprehensive removal of the material. For example, User Content that you have posted may be republished or reposted by another user."
                ],
                "Privacy Policy Updates": [
                    "We may update this Privacy Policy from time to time. When we update the Privacy Policy, we will notify you by updating the “Last Updated” date at the top of the new Privacy Policy, posting the new Privacy Policy, or providing any other notice required by applicable law. We recommend that you review the Privacy Policy each time you visit the Platform to stay informed of our privacy practices."
                ],
                "Contact Us": [
                    "Questions, comments and requests regarding this Privacy Policy should be addressed to:"
                ]
            }
        }
    ],
    "last_update": {
        "What Information We Collect": [
            "We may collect information from and about you, including information that you provide, information from other sources, and automatically collected information.",
            "When you create an account, upload content, contact us directly, or otherwise use the Platform, you may provide some or all of the following information:",
            "We may receive the information described in this Privacy Policy from other sources, such as:",
            "We automatically collect certain information from you when you use the Platform, including internet or other network activity information such as your IP address, geolocation-related data, unique device identifiers, browsing and search history (including content you have viewed in the Platform), andCookies.",
            "We may link your contact or account information with your activity on and off our Platform across all your devices, using your email or other log-in or device information. We may use this information to display advertisements on our Platform tailored to your interests, preferences, and characteristics.",
            "We are not responsible for the privacy practices of our service providers and business partners, and the information practices of these service providers and business partners are not covered by this Privacy Policy.",
            "We may aggregate or de-identify the information described above. Aggregated or de-identified data is not subject to this Privacy Policy."
        ],
        "How We Use Your Information": [
            "As explained below, we use your information to improve, support and administer the Platform, to allow you to use its functionalities, and to fulfill and enforce our Terms of Service. We may also use your information to, among other things, show you suggestions, promote the Platform, and customize your ad experience.",
            "We generally use theInformation We Collect:"
        ],
        "How We Share Your Information": [
            "We are committed to maintaining your trust, and while TikTok does not sell your personal information or share your personal information with third parties for purposes of cross-context behavioral advertising where restricted by applicable law, we want you to understand when and with whom we may share theInformation We Collectfor business purposes.",
            "We share the categories of personal information listed above with service providers and business partners to help us perform business operations and for business purposes, including research, payment processing and transaction fulfillment, database maintenance, administering contests and special offers, technology services, deliveries, sending communications, advertising and marketing services, analytics, measurement, data storage and hosting, disaster recovery, search engine optimization, and data processing. These service providers and business partners may include:",
            "As a global company, the Platform is supported by certain entities within our corporate group, which are given limited remote access toInformation We Collectas necessary to enable them to provide certain important functions. To learn more about how we share information with certain corporate group entities, seehere.",
            "We may share all of theInformation We Collectin connection with a substantial corporate transaction, such as the sale of a website, a merger, consolidation, asset sales, or in the unlikely event of bankruptcy.",
            "We may disclose any of theInformation We Collectto respond to subpoenas, court orders, legal process, law enforcement requests, legal claims, or government inquiries, and to protect and defend the rights, interests, safety, and security of the Platform, our affiliates, users, or the public. We may also share any of theInformation We Collectto enforce any terms applicable to the Platform, to exercise or defend any legal claims, and comply with any applicable law.",
            "We may share your information for other purposes pursuant to your consent or at your direction.",
            "We partner with third-party services (such as Facebook, Instagram, Twitter, and Google) to offer you a seamless sign-up, log-in, and content-sharing experience. We may share information about you with these third-party services if you choose to use these features. For example, the services may receive information about your activity on the Platform and may notify your connections on the third-party services about your use of the Platform, in accordance with their privacy policies. If you choose to allow a third-party service to access your account, we will share certain information about you with the third party. Depending on the permissions you grant, the third party may be able to obtain your account information and other information you choose to provide.",
            "If you choose to engage in public activities on the Platform, you should be aware that any information you share may be read, collected, or used by other users. You should use caution in disclosing personal information while using the Platform. We are not responsible for the information you choose to submit.",
            "When you make a purchase from a third party on the Platform, including from a merchant selling products through our shopping features, we share the information related to the transaction with that third party and their service providers and transaction fulfillment providers. By making the purchase, you are directing us to share your information in this way. These entities may use the information shared in accordance with their privacy policies."
        ],
        "Your Rights": [
            "You may submit a request to know, access, correct or delete the information we have collectedfrom orabout you athttps://www.tiktok.com/legal/report/privacy. You may appeal any decision we have made about your request by following the instructions in the communication you receive from us notifying you of our decision. You may also exercise your rights to know, access, correct, delete, or appealby sending your request to the physical address provided in the “Contact Us” section below. You can also update your account information directly through your in-app settings, as well as request a copy of your TikTok data or request to deactivate or delete your account. Your right to know includes what personal information we have collected about you, including the categories of sources from which the personal information is collected, the business or commercial purpose for collecting or sharing personal information, the categories of third parties to whom we share the personal information, and the specific pieces of personal information we have collected about you. We do not discriminate based on the exercise of any privacy rights that you might have.",
            "You may be entitled, in accordance with applicable law, to submit a request through an authorized agent. To designate an authorized agent to exercise choices on your behalf, please provide evidence that you have given such agent power of attorney or that the agent otherwise has valid written authority to submit requests to exercise rights on your behalf. We will respond to your request consistent with applicable law and subject to proper verification. We will verify your request by asking you to send it from the email address associated with your account or to provide information necessary to verify your account.",
            "More information about requests that we received can be foundhere.",
            "While some of the information that we collect and use may constitute sensitive personal information, we only process such information in order to provide the Platform and within other exemptions under applicable law. For example, we may process your financial information in order to provide you the goods or services you request from us or your driver’s license number in order to verify your identity."
        ],
        "Your Choices": [],
        "Data Security and Retention": [
            "We use reasonable measures to help protect information from loss, theft, misuse, unauthorized access, disclosure, alteration, or destruction. You should understand that no data storage system or transmission of data over the Internet or any other public network can be guaranteed to be 100 percent secure. Please note that information collected by third parties may not have the same security protections as information you submit to us, and we are not responsible for protecting the security of such information.",
            "We retain information for as long as necessary to provide the Platform and for the other purposes set out in this Privacy Policy. We also retain information when necessary to comply with contractual and legal obligations, when we have a legitimate business interest to do so (such as improving and developing the Platform, and enhancing its safety, security and stability), and for the exercise or defense of legal claims.",
            "The retention periods are different depending on different criteria, such as the type of information and the purposes for which we use the information. For example, when we process your information such as your profile information to provide you with the Platform, we keep this information for as long as you have an account. If you violate our Terms of Service, Community Guidelines, or other conditions or policies, we may remove your profile immediately, but may keep other information about you to process the violation.",
            "TikTok may transmit your data to its servers or data centers outside of the United States for storage and/or processing. Other entities with whom TikTok may share your data as described herein may be located outside of the United States."
        ],
        "Children and Teens": [
            "The privacy of Children is important to us. We provide a separate experience for Children in the United States, in which we collect and process only limited information. For information about how we collect, use, share, and otherwise process the personal information of Children, please refer to ourChildren’s Privacy Policy.",
            "The Platform otherwise is not directed at Children. If we become aware that personal information has been collected on the Platform from a Child, we will delete this information and terminate the Child’s account. If you believe there is a user who is below the age of 13, please contact us at:https://tiktok.com/legal/report/privacy.",
            "If you are a parent or guardian, ourGuardian's Guidecontains information and resources to help you understand the Platform and the tools and controls you can use."
        ],
        "Other Rights": [
            "If you are a California resident, once a calendar year, you may be entitled to obtain information about personal information that we shared, if any, with other businesses for their own direct marketing uses. To submit a request, contact us at:https://www.tiktok.com/legal/report/privacy.",
            "Users of the Platform who are California residents and are under 18 years of age may request and obtain removal of User Content they posted by contacting us at:https://www.tiktok.com/legal/report/privacy. All requests must provide a description of the User Content you want removed and information reasonably sufficient to permit us to locate that User Content. We do not accept California Removal Requests via postal mail, telephone, or facsimile. We may not be able to respond if you do not provide adequate information. Please note that your request does not ensure complete or comprehensive removal of the material. For example, User Content that you have posted may be republished or reposted by another user."
        ],
        "Privacy Policy Updates": [
            "We may update this Privacy Policy from time to time. When we update the Privacy Policy, we will notify you by updating the “Last Updated” date at the top of the new Privacy Policy, posting the new Privacy Policy, or providing any other notice required by applicable law. We recommend that you review the Privacy Policy each time you visit the Platform to stay informed of our privacy practices."
        ],
        "Contact Us": [
            "Questions, comments and requests regarding this Privacy Policy should be addressed to:"
        ]
    }
}