{"text": "GitHub Policy · GitHub\nSkip to content\nGitHub Universe is back:\nGet tickets now for 35% off, only until July 8\nToggle navigation\nSign in\nProduct\nActions\nAutomate any workflow\nPackages\nHost and manage packages\nSecurity\nFind and fix vulnerabilities\nCodespaces\nInstant dev environments\nCopilot\nWrite better code with AI\nCode review\nManage code changes\nIssues\nPlan and track work\nDiscussions\nCollaborate outside of code\nExplore\nAll features\nDocumentation\nGitHub Skills\nBlog\nSolutions\nFor\nEnterprise\nTeams\nStartups\nEducation\nBy Solution\nCI/CD & Automation\nDevOps\nDevSecOps\nResources\nLearning Pathways\nWhite papers, Ebooks, Webinars\nCustomer Stories\nPartners\nOpen Source\nGitHub Sponsors\nFund open source developers\nThe ReadME Project\nGitHub community articles\nRepositories\nTopics\nTrending\nCollections\nPricing\nSearch or jump to...\nSearch code, repositories, users, issues, pull requests...\nSearch\nClear\nSearch syntax tips\nProvide feedback\nWe read every piece of feedback, and take your input very seriously.\nInclude my email address so I can be contacted\nCancel\nSubmit feedback\nSaved searches\nUse saved searches to filter your results more quickly\nName\nQuery\nTo see all available qualifiers, see our\ndocumentation .\nCancel\nCreate saved search\nSign in\nSign up\nYou signed in with another tab or window.\nReload\nto refresh your session.\nYou signed out in another tab or window.\nReload\nto refresh your session.\nYou switched accounts on another tab or window.\nReload\nto refresh your session.\nDismiss alert\nPolicy\nBlog\nTwitter\nRepository\nTransparency Report\nGitHub Policy\nFighting for developers\nAs the home for all developers, GitHub is committed to shaping policies that promote their interests and the future of software. We work on policy in its many forms—laws, regulations, norms, and standard practices—to fight for developers when it matters most.\nSee our impact\nEvery developer has the right to do their best work. Period.\nNo matter who they are or where they are, we believe developers should be able to work on the projects they care about. This means advocating for policies that promote developers’ most basic rights: The rights to innovation, collaboration, and equal opportunity.\nAhmad Awais/ ahmadawais\n“This I believe is a big win for open source. Thank you GitHub!”\nCarlos Bordachar/ CarlosBordachar\n“Bien hecho! 👏”\nAndrew Eiche/ buddingmonkey\n“Let this be the new gold standard of fighting for your users!”\nAndrew Eiche/ buddingmonkey\n“Let this be the new gold standard of fighting for your users!”\nJeff Mosawy/ jmosawy\n“It couldn't get any better! A big THANK YOU to GitHub  ❤️ ”\nAhmad Awais/ ahmadawais\n“This I believe is a big win for open source. Thank you GitHub!”\nSamin Aref/ saref\n“Thank you Nat Friedman and GitHub for 👏 advocating for disadvantaged developers 👏 standing up against discriminatory rules and 👏 fighting for your values.”\nakazemi10\n“Great work by the team at GitHub 👏 This is amazing news for both Iranian developers and global developer collaboration.”\nJeff Mosawy/ jmosawy\n“It couldn't get any better! A big THANK YOU to GitHub  ❤️ ”\nInnovation\nDevelopers constantly solve new problems and build on previous solutions. Being a developer requires the freedom to experiment, learn, and share.\nCollaboration\nSoftware development is a global exercise in teamwork. In order to innovate, build, and keep the world’s software secure, developers must be able to work together.\nEqual Opportunity\nSoftware development thrives in an open and inclusive environment. When everyone has equal access and opportunity to contribute, we all benefit.\nHow we make an impact\nProtecting open source from EU copyright law\nWhen the EU began working on the Copyright Directive in 2016, software developers weren’t on policymakers’ minds. Drafts effectively required upload filters that would have wreaked havoc on online software collaboration. We worked to mobilize developers and convey their concerns to members of parliament, and together we succeeded: The final text included an exemption for “open source software developing and sharing platforms.”\nLearn more\nAdvancing developer freedom and access in Iran\nNo matter where developers may live, we’re committed to keeping as much of GitHub available to as many developers as possible. As part of this commitment to support software development everywhere, we make the case to governments for licenses and changes to the law. Starting in 2019, we worked with the US government’s Office of Foreign Assets Control to obtain a license to fully serve developers in Iran. Building on this success, we’re pursuing similar efforts to be able to fully serve developers in Crimea and Syria, and are also advocating for changes to the law so that all developers can have access — whether they use GitHub or other collaboration tools.\nLearn more\nEstablishing the Developer Defense Fund\nSection 1201 of the US DMCA can pose challenges to developers. Each year, GitHub receives a small number of 1201 takedown claims, contending that developers are hosting code that illegally circumvents a technological protection measure. To help, GitHub has committed $1 million to establish a Developer Defense Fund and sponsored the GitHub Developer Rights Fellowship at Stanford Law School’s Juelsgaard Intellectual Property and Innovation Clinic.\nLearn more\nAreas where we advocate\nPlatform responsibility\nProtecting developers’ ability to collaborate by providing a safe and inclusive space that transparently respects rights to free expression, assembly, and association.\nInnovation\nAdvocating for copyright, patent, and employment rules that foster exploration, collaboration, and the freedom to tinker on side projects.\nOpen source\nEncouraging governments to use open source as a tool of public policy, to work proactively with open source contributors, and to support open source software in legislation and regulation.\nGlobal collaboration\nSupporting developers to work with anyone, anywhere, so they can build secure and useful software that benefits their local communities.\nInclusion\nBreaking down barriers so anyone can become a developer and we can build a developer community that reflects our global diversity.\n“\nGitHub is leading the way for developers’ rights worldwide. Our Policy team uses its voice to advocate for the developer community and shape policies that impact the software ecosystem as a whole.\nMike Linksvayer\n//\nHead of Developer Policy\nLatest News\nRead More\nRead More\nRead More\nRead More\nView All Posts\nGet involved\nOpen an issue\nNeed help on a developer policy or want to share feedback?\nVisit our repository\nSend us an email\nInterested in collaborations or scheduling a meeting?\nEmail us\nSite-wide Links\nSubscribe to our developer newsletter\nGet tips, technical guides, and best practices. Twice a month. Right in your inbox.\nSubscribe\nProduct\nFeatures\nEnterprise\nCopilot\nSecurity\nPricing\nTeam\nResources\nRoadmap\nCompare GitHub\nPlatform\nDeveloper API\nPartners\nElectron\nGitHub Desktop\nSupport\nDocs\nCommunity Forum\nProfessional Services\nPremium Support\nSkills\nStatus\nContact GitHub\nCompany\nAbout\nCustomer stories\nBlog\nThe ReadME Project\nCareers\nPress\nInclusion\nSocial Impact\nShop\nGitHub on X\nGitHub on Facebook\nGitHub on LinkedIn\nGitHub on YouTube\nTwitch\nGitHub on Twitch\nTikTok\nGitHub on TikTok\nGitHub’s organization on GitHub\n©\n2024\nGitHub, Inc.\nTerms\nPrivacy\n( Updated\n08/2022 )\nSitemap\nWhat is Git?\nManage cookies\nDo not share my personal information\nYou can’t perform that action at this time."}